### Exercise1
Write a Pandas program to create and display a one-dimensional array-like object (Series) containing an array of data and then convert the Panda module Series to Python list.

In [1]:
import pandas as pd

In [2]:
#Hint
pd.Series.tolist?

In [3]:
in_list = [2,4,6,8,10]
#TODO for exercise 1

0     2
1     4
2     6
3     8
4    10
dtype: int64
[2, 4, 6, 8, 10]

### Exercise 2 
Create a DataFrame from given dictionary and convert the first column of a DataFrame as a Series.

In [4]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
#TODO for exercise2

Original DataFrame
   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

1st column as a Series:
0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

### Exercise 3
Create a subset of a given series in which the value are smaller than 6.

In [5]:
import pandas as pd
s = pd.Series([0, 1,2,3,4,5,6,7,8,9,10])
print("Original Data Series:")
print(s)
print("\nSubset of the above Data Series:")
#TODO for Exercise 3

Original Data Series:
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

Subset of the above Data Series:

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

### Exercise 4

Write a program to create Series given by the data list and index list and then change the order of index by the given inew index list. Then, sort the index by alphabetic order.

In [6]:
import pandas as pd
data_list = [1,2,3,4,5]
indx_list = ['A', 'B', 'C', 'D', 'E']
rindx_list = ['B','A', 'C', 'D', 'E'] # re-order the series by rindx_list

# TODO for Exercise 4

Original Data Series:
A    1
B    2
C    3
D    4
E    5
dtype: int64
Data Series after changing the order of index:
B    2
A    1
C    3
D    4
E    5
dtype: int64
Data Series after sorting:
A    1
B    2
C    3
D    4
E    5
dtype: int64

### Exercise 5

Write a Pandas program to create a DataFrame from the given dictionary and labels and select the rows where the score is missing, i.e. is NaN.

In [7]:
import pandas as pd
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
#TODO for Exercise 5, create DataFrame

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [8]:
#TODO for Exercise 5, select rows where the score is missing

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### Exercise 6

Write a Pandas program to create a data frame from the given dictionary and index and then insert a new column in existing DataFrame.

In [9]:
import pandas as pd
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
# insert a new column called color into the DataFrame
color = ['Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']

# TODO for Exercise 6

New DataFrame after inserting the 'color' column

        name  score  attempts qualify   color
a  Anastasia   12.5         1     yes     Red
b       Dima    9.0         3      no    Blue
c  Katherine   16.5         2     yes  Orange
d      James    NaN         3      no     Red
e      Emily    9.0         2      no   White
f    Michael   20.0         3     yes   White
g    Matthew   14.5         1     yes    Blue
h      Laura    NaN         1      no   Green
i      Kevin    8.0         2      no   Green
j      Jonas   19.0         1     yes     Red

### Exercise 7
Write a Pandas program to convert a given list of lists into a DataFrame and remove the last 2 rows.

In [10]:
import pandas as pd
my_lists = [['col1', 'col2'], [2, 4], [1, 3], [5, 2],[6, 3]]
#TODO for Exercise 7, convert a given list of lists into a DataFrame

   col1  col2
0     2     4
1     1     3
2     5     2
3     6     3

In [11]:
#TODO for Exercise 7, remove the last 2 rows

   col1  col2
0     2     4
1     1     3

### Exercise 8

Write a  program to select all columns, except one given column in a DataFrame

In [12]:
import pandas as pd
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
#TODO for Exercise 8, create a DataFrame

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [14]:
# TODO for Exercise 8, select all columns except 'col3'

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

### Exercise 9

Consider the medical data generated in Section 2.3:

In [15]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      36.0  36.3  28.0  36.1  32.0  37.6
     2      44.0  38.7  34.0  36.4  39.0  38.0
2014 1      55.0  37.7  46.0  36.0  30.0  37.7
     2      20.0  36.6  44.0  37.6  49.0  37.8

Calculate the maximum heart rate (HR) and temperature (Temp) of each person for the second visit for all years. The result should be a conventionally indexed DataFrame with rows indicating the type and column labels indicating person name.

In [16]:
#TODO for Exercise 9

subject   Bob  Guido   Sue
type
HR       44.0   44.0  49.0
Temp     38.7   37.6  38.0